podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/CAN2_FLEX_S32K14x.svd.xml
            <register>
               <name>CTRL1_PN</name>
               <description>Pretended Networking Control 1 Register</description>
               <addressOffset>0xB00</addressOffset>
               <resetValue>0x100</resetValue>
               <fields>
                  <field>
                     <name>FCS</name>
                     <description>Filtering Combination Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Message ID filtering only</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Message ID filtering and payload filtering</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Message ID filtering occurring a specified number of times</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Message ID filtering and payload filtering a specified number of times</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IDFS</name>
                     <description>ID Filtering Selection</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Match upon a ID contents against an exact target value</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Match upon a ID value greater than or equal to a specified target value</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Match upon a ID value smaller than or equal to a specified target value</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Match upon a ID value inside a range, greater than or equal to a specified lower limit and smaller than or equal a specified upper limit</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PLFS</name>
                     <description>Payload Filtering Selection</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00</name>
                           <description>Match upon a payload contents against an exact target value</description>
                           <value>0b00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b01</name>
                           <description>Match upon a payload value greater than or equal to a specified target value</description>
                           <value>0b01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b10</name>
                           <description>Match upon a payload value smaller than or equal to a specified target value</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11</name>
                           <description>Match upon a payload value inside a range, greater than or equal to a specified lower limit and smaller than or equal a specified upper limit</description>
                           <value>0b11</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NMATCH</name>
                     <description>Number of Messages Matching the Same Filtering Criteria</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b00000001</name>
                           <description>Received message must match the predefined filtering criteria for ID and/or PL once before generating a wake up event</description>
                           <value>0b1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b00000010</name>
                           <description>Received message must match the predefined filtering criteria for ID and/or PL twice before generating a wake up event</description>
                           <value>0b10</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b11111111</name>
                           <description>Received message must match the predefined filtering criteria for ID and/or PL 255 times before generating a wake up event</description>
                           <value>0b11111111</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WUMF_MSK</name>
                     <description>Wake Up by Match Flag Mask Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Wake up match event is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Wake up match event is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WTOF_MSK</name>
                     <description>Wake Up by Timeout Flag Mask Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Timeout wake up event is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Timeout wake up event is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL2_PN</name>
               <description>Pretended Networking Control 2 Register</description>
               <addressOffset>0xB04</addressOffset>
               <fields>
                  <field>
                     <name>MATCHTO</name>
                     <description>Timeout for No Message Matching the Filtering Criteria</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WU_MTC</name>
               <description>Pretended Networking Wake Up Match Register</description>
               <addressOffset>0xB08</addressOffset>
               <fields>
                  <field>
                     <name>MCOUNTER</name>
                     <description>Number of Matches while in Pretended Networking</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>WUMF</name>
                     <description>Wake Up by Match Flag Bit</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No wake up by match event detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Wake up by match event detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WTOF</name>
                     <description>Wake Up by Timeout Flag Bit</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>No wake up by timeout event detected</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Wake up by timeout event detected</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLT_ID1</name>
               <description>Pretended Networking ID Filter 1 Register</description>
               <addressOffset>0xB0C</addressOffset>
               <fields>
                  <field>
                     <name>FLT_ID1</name>
                     <description>ID Filter 1 for Pretended Networking filtering</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
                  <field>
                     <name>FLT_RTR</name>
                     <description>Remote Transmission Request Filter</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Reject remote frame (accept data frame)</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Accept remote frame</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLT_IDE</name>
                     <description>ID Extended Filter</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Accept standard frame format</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Accept extended frame format</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLT_DLC</name>
               <description>Pretended Networking DLC Filter Register</description>
               <addressOffset>0xB10</addressOffset>
               <resetValue>0x8</resetValue>
               <fields>
                  <field>
                     <name>FLT_DLC_HI</name>
                     <description>Upper Limit for Length of Data Bytes Filter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FLT_DLC_LO</name>
                     <description>Lower Limit for Length of Data Bytes Filter</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PL1_LO</name>
               <description>Pretended Networking payload Low Filter 1 Register</description>
               <addressOffset>0xB14</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_3</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_2</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_1</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_0</name>
                     <description>Payload Filter 1 low order bits for Pretended Networking payload filtering corresponding to the data byte 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PL1_HI</name>
               <description>Pretended Networking payload High Filter 1 Register</description>
               <addressOffset>0xB18</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_7</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_6</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 6</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_5</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_4</name>
                     <description>Payload Filter 1 high order bits for Pretended Networking payload filtering corresponding to the data byte 4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLT_ID2_IDMASK</name>
               <description>Pretended Networking ID Filter 2 Register / ID Mask Register</description>
               <addressOffset>0xB1C</addressOffset>
               <fields>
                  <field>
                     <name>FLT_ID2_IDMASK</name>
                     <description>ID Filter 2 for Pretended Networking Filtering / ID Mask Bits for Pretended Networking ID Filtering</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>29</bitWidth>
                  </field>
                  <field>
                     <name>RTR_MSK</name>
                     <description>Remote Transmission Request Mask Bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>The corresponding bit in the filter is &quot;don&apos;t care&quot;</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>The corresponding bit in the filter is checked</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RTR_MSK" > <name>IDE_MSK</name> <description>ID Extended Mask Bit</description> <bitOffset>30</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>PL2_PLMASK_LO</name>
               <description>Pretended Networking payload Low Filter 2 Register / payload Low Mask Register</description>
               <addressOffset>0xB20</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_3</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 3</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_2</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_1</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 1</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_0</name>
                     <description>Payload Filter 2 low order bits / Payload Mask low order bits for Pretended Networking payload filtering corresponding to the data byte 0</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PL2_PLMASK_HI</name>
               <description>Pretended Networking payload High Filter 2 low order bits / payload High Mask Register</description>
               <addressOffset>0xB24</addressOffset>
               <fields>
                  <field>
                     <name>Data_byte_7</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 7</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_6</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 6</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_5</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 5</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Data_byte_4</name>
                     <description>Payload Filter 2 high order bits / Payload Mask high order bits for Pretended Networking payload filtering corresponding to the data byte 4</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
